[
  {
    "text": "Scientific studies have shown that walking, besides its physical benefits, is also beneficial for the mind, improving memory skills, learning ability, concentration and abstract reasoning, as well as reducing stress and lifting spirits.",
    "author": "Wikipedia"
  },
  {
    "text": "The oldest known creature to have lived on land is Pneumodesmus newmani. It lived 428 million years ago.",
    "author": "Wikipedia"
  },
  {
    "text": "There are several theories of the adaptation value of bipedalism. It is possible that bipedalism was favored because it freed up the hands for reaching and carrying food and saved energy during locomotion.",
    "author": "Wikipedia"
  },
  {
    "text": "A new study provides support for the hypothesis that walking on two legs, or bipedalism, evolved because it used less energy than quadrupedal knuckle-walking.",
    "author": "Wikipedia"
  },
  {
    "text": "The first known animal that walked on two legs is the bolosaurid Eudibamus whose fossils date from 290 million years ago.",
    "author": "Wikipedia"
  },
  {
    "text": "Mudskippers are amphibious fish that can walk on land. These fish use their fins to move around in a series of skips. They can also flip their muscular bodies to catapult themselves up to 60 cm into the air.",
    "author": "Wikipedia"
  },
  {
    "text": "The first spacewalk was performed by Alexey Leonov on March 18, 1965 and lasted 12 minutes outside Voskhod 2 spacecraft.",
    "author": "Wikipedia"
  },
  {
    "text": "The first walk on the lunar surface was performed by Neil Armstrong and Buzz Aldrin on July 21, 1969. This Moon walk lasted 2 hours and 36 minutes.",
    "author": "Wikipedia"
  },
  {
    "text": "An early-morning walk is a blessing for the whole day.",
    "author": "Henry David Thoreau"
  },
  {
    "text": "My life is like a stroll upon the beach, As near the ocean's edge as I can go.",
    "author": "Henry David Thoreau"
  },
  {
    "text": "As a single footstep will not make a path on the earth, so a single thought will not make a pathway in the mind. To make a deep physical path, we walk again and again. To make a deep mental path, we must think over and over the kind of thoughts we wish to dominate our lives.",
    "author": "Henry David Thoreau"
  },
  {
    "text": "In every walk with nature one receives far more than he seeks.",
    "author": "John Muir"
  },
  {
    "text": "I only went out for a walk and finally concluded to stay out till sundown, for going out, I found, was really going in.",
    "author": "John Muir"
  },
  {
    "text": "Going to the mountains is going home.",
    "author": "John Muir"
  },
  {
    "text": "Between every two pines is a doorway to a new world.",
    "author": "John Muir"
  },
  {
    "text": "Pursue some path, however narrow and crooked, in which you can walk with love and reverence.",
    "author": "Henry David Thoreau"
  },
  {
    "text": "I'm a slow walker, but I never walk back.",
    "author": "Abraham Lincoln"
  },
  {
    "text": "A drawing is simply a line going for a walk.",
    "author": "Paul Klee"
  },
  {
    "text": "A vigorous five-mile walk will do more good for an unhappy but otherwise healthy adult than all the medicine and psychology in the world.",
    "author": "Paul Dudley White"
  },
  {
    "text": "Giant steps are what you take, Walking on the moon.",
    "author": "The Police"
  },
  {
    "text": "Take a walk with a turtle. And behold the world in pause.",
    "author": "Bruce Feiler"
  },
  {
    "text": "The best remedy for a short temper is a long walk.",
    "author": "Joseph Joubert"
  },
  {
    "text": "We must walk consciously only part way toward our goal, and then leap in the dark to our success.",
    "author": "Henry David Thoreau"
  },
  {
    "text": "The truth depends on a walk around a lake.",
    "author": "Wallace Stevens"
  },
  {
    "text": "There is no certainty, there is only adventure.",
    "author": "Roberto Assagioli"
  },
  {
    "text": "Be careful going in search of adventure - it's ridiculously easy to find.",
    "author": "William Least Heat-Moon"
  },
  {
    "text": "This is one small step for a man, one giant leap for mankind.",
    "author": "Neil Armstrong"
  },
  {
    "text": "When someone is impatient and says, 'I haven't got all day,' I always wonder, How can that be? How can you not have all day?",
    "author": "George Carlin"
  },
  {
    "text": "Home is everything you can walk to.",
    "author": "Jerry Spinelli"
  },
  {
    "text": "It is good to have an end to journey toward, but it is the journey that matters in the end.",
    "author": "Ursula K. Le Guin"
  },
  {
    "text": "Improvement makes strait roads, but the crooked roads without Improvement, are roads of Genius.",
    "author": "William Blake"
  }
]